export interface tasks {
    task: string;
}

const tasks: tasks[] = [
    {
        task:'Задано три числа. Якщо хоч одне з них парне, то знайти куб суми. В іншому випадку – суму кубів.'
    },
    {
        task: 'Знайдіть суму парних чисел  на заданому проміжку чисел [a,b]'
    },
    {
        task: 'Згенерувати матрицю розміром NxN. Виокремити за допомогою кольору усі парні від’ємні  елементи.'
    },
    {
        task: 'Створити додаток для табулювання і виведення на екран значення функції, також побудувати графік функції: '
    },
    {
        task: 'Необхідно додати у розроблений в попередній лабораторній роботі застосунок сторінку для обробки JSON файлу отриманого з серверу. Сторінку викликати у головному меню застосунку.'
    },
    {
        task: "Скласти програму з абстрактним батьківським класом і двома  об'єктами – нащадками.  Реалізувати циклічне виведення параметрів об'єктів, використовуючи полімор фний контейнер - масив об'єктів базового класу"
    },
    {
        task: "Дана наступна діаграма класів: Іграшка, продукт, товар, молочний продукт"
    },
    {
        task: "Провести табулювання, обрахувати за допомогою цклу та рекурсії наступну функцію:"
    }
]

export const getTasks = () => tasks;